---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCData.SetTypeList(System.Collections.Generic.IList{System.String})
source: html/ac2659f1-8e2c-6390-5d93-66ab161561a1.htm
---
# Autodesk.Revit.DB.IFC.IFCData.SetTypeList Method

## Syntax (C#)
```csharp
public void SetTypeList(
	IList<string> typeList
)
```

## Parameters
- **typeList** (`System.Collections.Generic.IList < String >`)